---
kind: type
id: T:Autodesk.Revit.DB.PropertyLine
source: html/780ace09-16a7-b622-d04d-05998be8eebb.htm
---
# Autodesk.Revit.DB.PropertyLine

Represents kinds of PropertyLines.

## Syntax (C#)
```csharp
public class PropertyLine : Element
```